src/Documents/ПриказОЗачислении/ПриказОЗачислении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОЗачислении</name>
  <registerRecords>InformationRegister.Учащиеся</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Студенты</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяСтаростой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбучениеНаБюджетнойОснове</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОбучения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПриказОЗачислении/ManagerModule.bsl
Процедура ПлатнаяФормаОбучения(ТабДок, Ссылка) Экспорт
	Макет = ПолучитьМакет("ПлатнаяФормаОбучения");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриказОЗачислении.Дата,
	|	ПриказОЗачислении.Курс,
	|	ПриказОЗачислении.Номер,
	|	ПриказОЗачислении.Факультет,
	|	ПриказОЗачислении.Студенты.(
	|		Студент КАК Студент,
	|		СуммаОбучения),
	|	ПриказОЗачислении.Факультет.Декан.Наименование КАК Декан,
	|	ПриказОЗачислении.Факультет.Декан.УченоеЗвание КАК УченоеЗвание,
	|	НазваниеУниверситета.Значение КАК НазваниеУниверситета
	|ИЗ
	|	Документ.ПриказОЗачислении КАК ПриказОЗачислении,
	|	Константа.НазваниеУниверситета КАК НазваниеУниверситета
	|ГДЕ
	|	ПриказОЗачислении.Ссылка В (&Ссылка)
	|	И ПриказОЗачислении.Студенты.ОбучениеНаБюджетнойОснове = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Студент";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтудентыШапка = Макет.ПолучитьОбласть("СтудентыШапка");
	ОбластьСтуденты = Макет.ПолучитьОбласть("Студенты");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD;");
		ОбластьЗаголовок.Параметры.Номер = СтрШаблон("№%1", XMLСтрока(Число(Выборка.Номер)));
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСтудентыШапка);
		ВыборкаСтуденты = Выборка.Студенты.Выбрать();
		НомерСтроки = 0;
		Итого = 0;

		Пока ВыборкаСтуденты.Следующий() Цикл
			ОбластьСтуденты.Параметры.Заполнить(ВыборкаСтуденты);

			НомерСтроки = НомерСтроки + 1;
			Итого = Итого + ВыборкаСтуденты.СуммаОбучения;
			ОбластьСтуденты.Параметры.СуммаОбучения = Формат(ВыборкаСтуденты.СуммаОбучения, "ЧДЦ=0;");
			ОбластьСтуденты.Параметры.НомерСтроки = НомерСтроки;

			ТабДок.Вывести(ОбластьСтуденты, ВыборкаСтуденты.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		Подвал.Параметры.ВсегоСтрок = НомерСтроки;
		Подвал.Параметры.Декан = ОбработкаНаименованияВызовСервера.ПолучитьФамилияИнициалыФизЛица(Выборка.Декан);
		Подвал.Параметры.Итого = Итого;
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры
